app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "confirm", "password_digest") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		 @user = User.new(user_params)

		 temp_password = String.new(@user.password)
		 temp_confirm = String.new(@user.confirm)

	    if temp_password == temp_confirm
	    	@user.save